Процедура ПередЗаписью(Отказ)
	Если не ПустаяСтрока(Наименование) Тогда
		УИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
		ТекущийПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
		Если ТекущийПользователь = Неопределено Тогда		
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользователь.Имя = Наименование;
			НовыйПользователь.ПолноеИмя = Наименование;
			//НовыйПользователь.Роли.Добавить(Метаданные.Роли[Роль]);
			НовыйПользователь.Записать();		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
