
&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	Получатели = Новый Массив;
	Если Получатель <> ПустаяСсылкаСправочника("Инициаторы") 
		И Получатель <> ПустаяСсылкаСправочника("Исполнители") 
		И Получатель <> ПустаяСсылкаСправочника("Координаторы") Тогда		
			Получатели.Добавить(Получатель);
			ОтправитьПисьмоНаПочту(Получатели);
	Иначе
		Сообщить("Получатель не выбран. Для отправки сообщения выберите получателя"); 
		Возврат;
	КонецЕсли;
	//ОтправитьПочту();	
КонецПроцедуры

//
&НаКлиенте
Процедура ОтправитьПочту()
	
	ПроверкаПросрочки();
	
	Для каждого Строка Из Объект.АдресаЭлПочты Цикл
	
	Адрес = Строка.АдресЭлПочты;
	Тема = "Уведомление о задаче" ;
	ТекстПисьма = "Текст письма";
	
	Попытка
		Outlook = Новый COMОбъект("Outlook.Application");
		ЕстьОшибка = 0;
	Исключение
		ПоказатьПредупреждение(,"Не удалось создать объект Outlook.Application");
		ЕстьОшибка = 1;
	КонецПопытки;
	
	Если ЕстьОшибка = 0 Тогда
		
		Письмо = Outlook.CreateItem(0);
		
		Письмо.Subject = Тема;        // Тема
		Письмо.Recipients.Add(Адрес); // Адрес получателя
		
		Письмо.Display();  // важно перед манипуляцией с подписью вызвать, ибо не получится
		сПодписи = Письмо.HTMLBody;
		
		Письмо.HTMLBody        = ТекстПисьма; // Текст письма HTML
		
		Письмо.HTMLBody    = Письмо.HTMLBody + сПодписи; //подпись
		
		Outlook.ActiveWindow().WindowState = 1;  // выводить письмо на передний план
		Outlook.ActiveWindow().Activate();
		
	Иначе
		СтрокаЗапуска = "mailto:" + Адрес + "?subject=" + Тема + "&body=" + ТекстПисьма;
		ЗапуститьПриложение(СтрокаЗапуска);
	КонецЕсли;
	
	КонецЦикла; 
КонецПроцедуры

//
&НаСервере
Процедура ПроверкаПросрочки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействиеПоЗадаче.Исполнитель.АдресЭлПочты КАК АдресЭлПочты,
	|	ДействиеПоЗадаче.Исполнитель,
	|	ДействиеПоЗадаче.Задача
	|ИЗ
	|	Документ.ДействиеПоЗадаче КАК ДействиеПоЗадаче
	
	|ГДЕ
	|	(РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокЧТЗ, ДЕНЬ) < 10
	|			ИЛИ РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокСдачиЗНИ, ДЕНЬ) < 10
	|			ИЛИ РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокДО, ДЕНЬ) < 10)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока =  Объект.АдресаЭлПочты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере 
Функция ПустаяСсылкаСправочника(Наименование)
	Возврат Справочники[Наименование].ПустаяСсылка();
КонецФункции

&НаСервере
 Процедура ОтправитьПисьмоНаПочту(ПользователиПолучатели) Экспорт
	УчетнаяЗаписьЭП = Справочники.ПредопределенныеЭлементы.УчетнаяЗапись;
	ПарольУчетнойЗаписи = Справочники.ПредопределенныеЭлементы.ПарольУчетнойЗаписи;
	НаименованиеПрограммы = Справочники.ПредопределенныеЭлементы.НаименованиеПрограммы;
	СерверВходящейПочты = Справочники.ПредопределенныеЭлементы.АдресIMAP;
	СерверИсходящейПочты = Справочники.ПредопределенныеЭлементы.АдресSMTP;
	ПортСервераВходящейПочты = Справочники.ПредопределенныеЭлементы.ПортIMAP; 
	ПортСервераИсходящейПочты = Справочники.ПредопределенныеЭлементы.ПортSMTP;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераIMAP = СерверВходящейПочты.Значение;
	Профиль.АдресСервераSMTP = СерверИсходящейПочты.Значение;
	Профиль.ПортIMAP = 0;//ПортСервераВходящейПочты.Значение;
	Профиль.ПортSMTP = 0;//ПортСервераИсходящейПочты.Значение;
	Профиль.ПользовательIMAP = НаименованиеПрограммы.Значение;
	Профиль.ПарольIMAP = ПарольУчетнойЗаписи.Значение;
	Профиль.ПользовательSMTP= НаименованиеПрограммы.Значение;
	Профиль.ПарольSMTP = ПарольУчетнойЗаписи.Значение;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	
	Почта = Новый ИнтернетПочта;
	ТекстОшибки = "";
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Не удалось подключиться к серверу почты отправителя");
	КонецПопытки;
	
	
	Письмо = Новый ИнтернетПочтовоеСообщение; 
	ТемаПисьма = "";
	Письмо.Тема = НСтр("ru = '"+ТемаПисьма+"'");
	ТекстПисьма = ""; 
	Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстПисьма+"'"));	
	Письмо.ИмяОтправителя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.ОтображаемоеИмя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.Адрес = УчетнаяЗаписьЭП.Значение;
	
	
	Для каждого ПользовательПолучатель Из ПользователиПолучатели Цикл
		Если ПользовательПолучатель.АдресЭлПочты = "" Тогда
			Сообщить("У получателя "+ПользовательПолучатель.Наименование+" не указана почта. Сообщение не будет отправлено "+ПользовательПолучатель.Наименование);
		Иначе 
			ПолучательПисьма = Письмо.Получатели.Добавить(ПользовательПолучатель.АдресЭлПочты);
			ПолучательПисьма.ОтображаемоеИмя = НСтр("ru = '"+ПользовательПолучатель.Наименование+"'");
		КонецЕсли;
	КонецЦикла;
	//Письмо.Вложения.Добавить(Файл);	
	
	
	Попытка
		Почта.Послать(Письмо);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Не удалось отправить письмо");
	КонецПопытки;
	
	
	Почта.Отключиться();
	Письмо.Вложения.Очистить();	
	ПисьмоОтправлено = Истина;
	
КонецПроцедуры 