Процедура ПередЗаписью(Отказ)	
		
		УИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
		Если Пользователь = Неопределено Тогда			
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();		
			НовыйПользователь.Имя = ЭтотОбъект.Наименование;
			НовыйПользователь.Имя = Наименование;
			Если Не ПустаяСтрока(ПолноеНаименование) Тогда			
				НовыйПользователь.ПолноеИмя = ПолноеНаименование;
			Иначе
				НовыйПользователь.ПолноеИмя = Наименование;
			КонецЕсли;
			
			Если ДополнительныеСвойства.Свойство("СписокРолейМодифицированность") И ДополнительныеСвойства.Свойство("СписокРолей") Тогда
				Если ДополнительныеСвойства.СписокРолейМодифицированность Тогда					
					Для Каждого Строка Из ЭтотОбъект.СписокРолей Цикл 
						Для Каждого Элемент Из ДополнительныеСвойства.СписокРолей Цикл
							Если Строка.РольСиноним = Элемент.Представление Тогда
								НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти(Элемент.Значение));
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					КонецЦикла;;
				КонецЕсли;
			КонецЕсли;
			
			НовыйПользователь.Записать();
			НоваяСсылка = Справочники.Пользователи.ПолучитьСсылку(НовыйПользователь.УникальныйИдентификатор);			
			ЭтотОбъект.УстановитьСсылкуНового(НоваяСсылка);		
		ИначеЕсли ДополнительныеСвойства.Свойство("Модифицированность") Тогда
			
			Пользователь.Имя = Наименование;
			Пользователь.ПолноеИмя = Наименование;
			
			Если ДополнительныеСвойства.Свойство("СписокРолейМодифицированность") И ДополнительныеСвойства.Свойство("СписокРолей") Тогда
				Если ДополнительныеСвойства.СписокРолейМодифицированность Тогда					
					Для Каждого Строка Из ЭтотОбъект.СписокРолей Цикл 
						Для Каждого Элемент Из ДополнительныеСвойства.СписокРолей Цикл
							Если Строка.РольСиноним = Элемент.Представление Тогда
								Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Элемент.Значение));
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					КонецЦикла;;
				КонецЕсли;
			КонецЕсли;
			Пользователь.Записать();
		КонецЕсли;			
	
	КонецПроцедуры
