
&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЛет());
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЛет()
	СписокЛет = Новый Массив;
	Для Год = 2021 По 2121 Цикл
		СписокЛет.Добавить(Год);
		Год = Год + 1;
	КонецЦикла;
	Возврат СписокЛет;
КонецФункции

&НаКлиенте
Процедура ВыгрузкаПроизводственногоКалендаря(Команда)
	Если ПустаяСтрока(Файл) Тогда
		Сообщить("Выгрузка не выполнена! Не выбран Файл для выгрузки.");
	Иначе
		ВыгрузкаПроизводственногоКалендаряНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаПроизводственногоКалендаряНаСервере() 
	
	СтрокаГод = СтрЗаменить(Год, Символы.НПП, "");
	НачалоИнтервала = Дата(СтрокаГод+"0101");
	КонецИнтервала = Дата(СтрокаГод+"1231");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныйКалендарь.Период,
		|	ПроизводственныйКалендарь.Календарь,
		|	ПроизводственныйКалендарь.Год,
		|	ПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		|ГДЕ
		|	ПроизводственныйКалендарь.Период >= &НачалоИнтервала
		|	И ПроизводственныйКалендарь.Период <= &КонецИнтервала";
	
	Запрос.УстановитьПараметр("КонецИнтервала", КонецИнтервала);
	Запрос.УстановитьПараметр("НачалоИнтервала", НачалоИнтервала);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	Если ТаблицаЗначений.Количество() > 0 Тогда
		ПостроительОтчета = Новый ПостроительОтчета;
		ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаЗначений);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ПостроительОтчета.Вывести(ТабличныйДокумент);
		ТабличныйДокумент.Записать(Файл, ТипФайлаТабличногоДокумента.XLSX);
		Сообщить("Выгрузка выполнена успешно!");
	Иначе
		Сообщить("Выгрузка не выполнена! На выбранную дату отсутсвуют записи.");
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаПроизводственногоКалендаря(Команда)
	Если ПустаяСтрока(Файл) Тогда
		Сообщить("Загрузка не выполнена. Не выбран Файл для загрузки.");
    Иначе 
		ЗагрузкаПроизводственногоКалендаряНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПроизводственногоКалендаряНаСервере()
	Excel=Новый COMObject("Excel.Application");
	Книга=Excel.Workbooks;
	Книга.Open(Файл);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Период");
	ТаблицаЗначений.Колонки.Добавить("Календарь");
	ТаблицаЗначений.Колонки.Добавить("Год");
	ТаблицаЗначений.Колонки.Добавить("ВидДня");
	
	СчетчикЦикла=2;
	
	НаборЗаписей = РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Установить(Год);
	
	Пока СокрЛП(Excel.Cells(СчетчикЦикла,1).value) <> "" Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=СокрЛП(Excel.Cells(СчетчикЦикла,1).value);
		НоваяЗапись.Календарь=Справочники.Календари.ПроизводственныйКалендарь;
		НоваяЗапись.Год=Год;
		ВидДня = СокрЛП(Excel.Cells(СчетчикЦикла,2).value);
		Если ВидДня = "Рабочий" Тогда  
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
		ИначеЕсли ВидДня = "Нерабочий" Тогда  
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Нерабочий;
		ИначеЕсли ВидДня = "Суббота" Тогда 
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота;
		ИначеЕсли ВидДня = "Воскресенье" Тогда 
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
		ИначеЕсли ВидДня = "Праздник" Тогда
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
		Иначе 
			НоваяЗапись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный;
		КонецЕсли;
		НоваяЗапись.ДатаПереноса = СокрЛП(Excel.Cells(СчетчикЦикла,3).value);
		СчетчикЦикла=СчетчикЦикла+1;
		
	КонецЦикла;
	
	Excel.Application.Quit(); 
	
	Если  СчетчикЦикла = 2 Тогда
		Сообщить("Загрузка не выполнена! Отсутсвуют записи в файле."); 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.Записать(); 
	Сообщить("Загрузка выполнена успешно!");	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.ПолноеИмяФайла = Файл;
	
	Если Диалог.Выбрать() Тогда
		Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецПроцедуры



