
&НаКлиенте
Процедура ВыгрузкаПроизводственногоКалендаря(Команда)
	ВыгрузкаПроизводственногоКалендаряНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаПроизводственногоКалендаряНаСервере()   
	
	ЗаписьXML = Новый ЗаписьXML;	
	Файл = Новый ТекстовыйДокумент;
	Путь = "C:\Users\innai\Desktop\Test.xml";
	Файл.Записать(Путь);
	ЗаписьXML.ОткрытьФайл(Путь, "UTF-8");	
	ЗаписьXML.ЗаписатьОбъявлениеXML();  	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Производственный календарь"); 
	СтрокаГод = СтрЗаменить(Год, Символы.НПП, "");
	НачалоИнтервала = Дата(СтрокаГод+"0101");
	КонецИнтервала = Дата(СтрокаГод+"1231");
	
	//XML
	Выборка = РегистрыСведений.ПроизводственныйКалендарь.Выбрать(НачалоИнтервала,КонецИнтервала);	
	Пока Выборка.Следующий() Цикл  
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Дата"); 	
		ЗаписьXML.ЗаписатьАтрибут("Календарь",Строка(Выборка.Календарь));
		ЗаписьXML.ЗаписатьАтрибут("Год",Строка(Выборка.Год));
		ЗаписьXML.ЗаписатьАтрибут("ВидДня",Строка(Выборка.ВидДня));
		ЗаписьXML.ЗаписатьАтрибут("ДатаПереноса",Строка(Выборка.ДатаПереноса));		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//
	
	//XLSX
	
	
	//
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Год = Год(ТекущаяДата());
КонецПроцедуры



