
&НаКлиенте
Процедура ПоказатьГрафикРаботы(Команда)
	Если Сотрудник = ПолучитьПустуюСсылкуИсполнители() Тогда
		Сообщить("Действие не моджет быть выполнено. Не заполнено поле ""Сотрудник"" ");
	Иначе 
		ПоказатьГрафикРаботыНаСервере();
		Элементы.ГрафикРаботыВидВремениРаботы.Доступность = Ложь;
		Элементы.ГрафикРаботыВидВремениРаботы.ЦветФона = Новый Цвет(252,250,235); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьГрафикРаботыНаСервере()
	Если Элементы.Сотрудник <> Справочники.Исполнители.ПустаяСсылка()И
		Элементы.Год <> 0 Тогда
	Иначе
		Сообщить("Действие не может быть выполнено. Не заполнены поля Сотрудник и Год");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендарьГрафиковРаботы.Период,
		|	КалендарьГрафиковРаботы.ВидВремениРаботы,
		|	ВЫБОР
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 1
		|			ТОГДА ""Понедельник""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 2
		|			ТОГДА ""Вторник""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 3
		|			ТОГДА ""Среда""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 4
		|			ТОГДА ""Четверг""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 5
		|			ТОГДА ""Пятница""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 6
		|			ТОГДА ""Суббота""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 7
		|			ТОГДА ""Воскресенье""
		|	КОНЕЦ КАК ДеньНедели,
		|	ЛОЖЬ КАК Изменен
		|ИЗ
		|	РегистрСведений.КалендарьГрафиковРаботы КАК КалендарьГрафиковРаботы
		|ГДЕ
		|	КалендарьГрафиковРаботы.Сотрудник = &Сотрудник
		|	И КалендарьГрафиковРаботы.Год = &Год";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Год", Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ГрафикРаботы.Загрузить(РезультатЗапроса.Выгрузить());
	
	Элементы.ИзменитьГрафикРаботы.Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюСсылкуИсполнители()
	Возврат Справочники.Исполнители.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ИзменитьГрафикРаботы(Команда)
	Элементы.ГрафикРаботыВидВремениРаботы.Доступность = Истина;
	Элементы.ГрафикРаботыВидВремениРаботы.ЦветФона = Новый Цвет(255,255,255); 
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВидВремениРаботыПриИзменении(Элемент)
	Элементы.СохранитьИменения.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИменения(Команда)
	СохранитьИмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИмененияНаСервере()
	
	Для Каждого Запись Из Объект.ГрафикРаботы Цикл	
		МенеджерЗаписи = РегистрыСведений.КалендарьГрафиковРаботы.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Период = Запись.Период;
		МенеджерЗаписи.Год = Год;
		МенеджерЗаписи.Сотрудник = Сотрудник;
		МенеджерЗаписи.ВидВремениРаботы = Запись.ВидВремениРаботы;
		МенеджерЗаписи.КоличествоРабочихЧасов = 8;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	Сообщить("Изменения сохранениы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Число = 2021;
	//Пока Число < 2021 Цикл
	//	Элементы.Год.СписокВыбора.Добавить(Число);
	//	Число = Число + 1;
	//КонецЦикла;
	Год = Год(ТекущаяДата());
КонецПроцедуры



