
&НаКлиенте
Процедура ПоказатьГрафикРаботы(Команда)
	Если Элементы.Сотрудник = ПолучитьПустуюСсылкуИсполнители() Или Элементы.Год = 0 Тогда
		Сообщить("Действие не моджет быть выполнено. Не заполнены поля сотрудник и/или год");
	Иначе 
		ПоказатьГрафикРаботыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьГрафикРаботыНаСервере()
	Если Элементы.Сотрудник <> Справочники.Исполнители.ПустаяСсылка()И
		Элементы.Год <> 0 Тогда
	Иначе
		Сообщить("Действие не может быть выполнено. Не заполнены поля Сотрудник и Год");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендарьГрафиковРаботы.Период,
		|	КалендарьГрафиковРаботы.ВидВремениРаботы,
		|	ЛОЖЬ КАК Изменен
		|ИЗ
		|	РегистрСведений.КалендарьГрафиковРаботы КАК КалендарьГрафиковРаботы
		|ГДЕ
		|	КалендарьГрафиковРаботы.Сотрудник = &Сотрудник
		|	И КалендарьГрафиковРаботы.Год = &Год";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Год", Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ГрафикРаботы.Загрузить(РезультатЗапроса.Выгрузить());
	
	Элементы.ИзменитьГрафикРаботы.Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюСсылкуИсполнители()
	Возврат Справочники.Исполнители.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ИзменитьГрафикРаботы(Команда)
	Элементы.ГрафикРаботыВидВремениРаботы.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВидВремениРаботыПриИзменении(Элемент)
	Элементы.СохранитьИменения.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИменения(Команда)
	СохранитьИмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИмененияНаСервере()
	
	Для Каждого Запись Из Объект.ГрафикРаботы Цикл	
		МенеджерЗаписи = РегистрыСведений.КалендарьГрафиковРаботы.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Период = Запись.Период;
		МенеджерЗаписи.Год = Год;
		МенеджерЗаписи.Сотрудник = Сотрудник;
		МенеджерЗаписи.ВидВремениРаботы = Перечисления.ВидыВремениРаботы.Выходной;
		МенеджерЗаписи.КоличествоРабочихЧасов = 8;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры


