&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокРолейМодифицированность = Ложь;
	УстановкаПросмотра();
	Элементы.СписокРолейРоль.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокРолей());	
КонецПроцедуры

&НаКлиенте
Процедура СписокРолейПриИзменении(Элемент)
	СписокРолейМодифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРолей()
	СписокСинонимов = Новый Массив;
	Для Каждого Роль Из Метаданные.Роли Цикл
		СписокСинонимов.Добавить(Роль.Синоним);
		СписокРолей.Добавить(Строка(Роль.Имя), Роль.Синоним);
	КонецЦикла;
	Возврат СписокСинонимов;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СписокРолейМодифицированность", СписокРолейМодифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СписокРолей", СписокРолей);
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСотрудникПриИзменении(Элемент)
	УстановкаПросмотра();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПросмотра()
	Если Объект.ЕстьСотрудник = Истина Тогда
		Элементы.Сотрудник.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Сотрудник.ТолькоПросмотр = Истина;
		Объект.Сотрудник = ПустаяСсылкаСотрудник();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПустаяСсылкаСотрудник()
	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции
