
&НаКлиенте
Процедура СогласованияПриИзменении(Элемент)
	Элементы.СогласованиеТЗ.Видимость = Согласования;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ПриОткрытииНаСервере();
	Элементы.ПодготовкаТЗ.Обновить();
	Элементы.СогласованиеТЗ.Обновить();
	Элементы.ВРаботе.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	
	 ЭлементОтбора = ПодготовкаТЗ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
     ЭлементОтбора.ПравоеЗначение = Сотрудник;
	 
	 ЭлементОтбора = ПодготовкаТЗ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	 ЭлементОтбора.ПравоеЗначение = Справочники.Статусы.ПодготовкаТЗ;
	 
	 ЭлементОтбора = СогласованиеТЗ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
     ЭлементОтбора.ПравоеЗначение = Сотрудник;
	 
	 ЭлементОтбора = СогласованиеТЗ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
     ЭлементОтбора.ПравоеЗначение = Справочники.Статусы.СогласованиеТЗ;
	 
	 ЭлементОтбора = ВРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
     ЭлементОтбора.ПравоеЗначение = Сотрудник;
	 
	 ЭлементОтбора = ВРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
     ЭлементОтбора.ПравоеЗначение = Справочники.Статусы.ВРаботе;

КонецПроцедуры

