
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УправлениеЗадачей") Тогда
		Основание = ДанныеЗаполнения;
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() И Основание.Исполнитель <> Справочники.Сотрудники.ПустаяСсылка() Тогда
		Если НЕ Задачи.ЗадачиИсполнителя.НайтиПоРеквизиту("Основание", ЭтотОбъект.Основание.Ссылка.Пустая()) Тогда
			Сообщить ("Задача по данноому документу уже заведена.");
			Отказ = Истина;
			Возврат;
		Иначе
			ОтправитьПисьмоНаПочту();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьПисьмоНаПочту()
	ПисьмоОтправлено = Ложь;

	УчетнаяЗаписьЭП = Справочники.УчетныеЗаписиЭлПочты.СистемнаяУчетнаяЗапись;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераIMAP = УчетнаяЗаписьЭП.АдресIMAP;
	Профиль.ПортIMAP = УчетнаяЗаписьЭП.ПортIMAP;
	Профиль.ПользовательIMAP = УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.ПарольIMAP = УчетнаяЗаписьЭП.Пароль;
	
	Профиль.АдресСервераSMTP =  УчетнаяЗаписьЭП.АдресSMTP;
	Профиль.ПортSMTP = УчетнаяЗаписьЭП.ПортSMTP;
	Профиль.ПользовательSMTP= УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.ПарольSMTP = УчетнаяЗаписьЭП.Пароль;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Профиль.Пользователь = УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.Пароль = УчетнаяЗаписьЭП.Пароль;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщить("Не удалось подключиться к серверу почты отправителя! " + ОписаниеОшибки());
	КонецПопытки;
	 	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТемаПисьма = "Новая задача в 1С:Управление сервисом ИТ";
	Письмо.Тема = НСтр("ru = '"+ТемаПисьма+"'");
	
	ТекстПисьма= Основание.Исполнитель.Наименование + ", Вам назначена новая задача """ + Наименование + """ от " + Дата + ".";
	Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстПисьма+"'"));
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		ТекстКомментария = "Комментарий по задаче: " + Комментарий;
		Письмо.Тексты.Добавить( НСтр("ru = '"+ Символы.ПС +"'"));
		Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстКомментария+"'"));
	КонецЕсли;
	
	Письмо.ИмяОтправителя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.ОтображаемоеИмя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.Адрес = УчетнаяЗаписьЭП.АдресЭлПочта;
	
	Получатели = Новый Массив;
	Получатели.Добавить(Основание.Исполнитель);
	
	Для каждого Получатель Из Получатели Цикл
		Если Получатель.АдресЭлПочты = "" Тогда
			Сообщить("У получателя "+Получатель.Наименование+" не указана почта! Письмо не будет отправлено.");
		Иначе 
			ПолучательПисьма = Письмо.Получатели.Добавить(Получатель.АдресЭлПочты);
			ПолучательПисьма.ОтображаемоеИмя = НСтр("ru = '"+Получатель.Наименование+"'");
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		Почта.Послать(Письмо);
		ПисьмоОтправлено = Истина;
	Исключение
		Сообщить("Не удалось отправить письмо! "+ ОписаниеОшибки());
	КонецПопытки;
		
	Почта.Отключиться();
	Письмо.Вложения.Очистить();	
	Если ПисьмоОтправлено Тогда
		Сообщить("Письмо успешно отправлено!");
	КонецЕсли;
КонецПроцедуры 



