Перем ЗаполнитьГрафик;

Процедура ПередЗаписью(Отказ)
	ЗаполнитьГрафик = Ложь;
	Если Не ПустаяСтрока(Наименование) Тогда
		Если ПустаяСтрока(ЭтотОбъект.УИДИБ) Тогда		
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользователь.Имя = Наименование;
			НовыйПользователь.ПолноеИмя = Наименование;
			//НовыйПользователь.Роли.Добавить(Метаданные.Роли[Роль]);
			НовыйПользователь.Записать();
			ЗаполнитьГрафик = Истина;
			ЭтотОбъект.УИДИБ = НовыйПользователь.УникальныйИдентификатор;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
 
Процедура ЗаполнитьГрафикРаботы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныйКалендарь.Период,
		|	ПроизводственныйКалендарь.Год,
		|	ПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.КалендарьГрафиковРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(ЭтотОбъект.Ссылка); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Сотрудник = ЭтотОбъект.Ссылка;
		НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Дата;  
		НоваяЗапись.Год = ВыборкаДетальныеЗаписи.Год;
		Если ВыборкаДетальныеЗаписи.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Или  ВыборкаДетальныеЗаписи.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
			НоваяЗапись.ВидВремениРаботы = Перечисления.ВидыВремениРаботы.Основной;
		Иначе
			НоваяЗапись.ВидВремениРаботы = Перечисления.ВидыВремениРаботы.Выходной;
		КонецЕсли;
		НоваяЗапись.КоличествоРабочихЧасов = 8; 
	КонецЦикла;
		
	НаборЗаписей.Записать();	
КонецПроцедуры                                                              

Процедура ПриЗаписи(Отказ)
	Если ЗаполнитьГрафик Тогда
		ЗаполнитьГрафикРаботы();
	КонецЕсли;
КонецПроцедуры
