
Процедура ЗаписьИсторииДокументов()
	
	Запись = РегистрыСведений.ИсторииЗадач.СоздатьМенеджерЗаписи();
	Запись.ДатаЗаписи 	= ТекущаяДата();
	Запись.АвторИзменения = ЭтотОбъект.ПоследнееИзменениеДокумента;
	Запись.Ссылка 		= ЭтотОбъект.Ссылка;
	Запись.Задача			= ЭтотОбъект.Задача;
	Запись.Инициатор	= ЭтотОбъект.Инициатор;
	Запись.Исполнитель	= ЭтотОбъект.Исполнитель;
	Запись.ДополнительныйИсполнитель	= ЭтотОбъект.ДополнительныйИсполнитель;
	Запись.Статус	= ЭтотОбъект.Статус;
	Запись.ПлановоеОкончаниеРаботПоСтатусу = ЭтотОбъект.ПлановоеОкончаниеРаботПоСтатусу;
	Запись.КомментарийПоСменеСтатуса	= ЭтотОбъект.ДополнительнаяИнформация;
	Запись.КомментарийПоЗадаче	= ЭтотОбъект.КомментарийПоЗадаче;
	Запись.ПроцентВыполнения = ЭтотОбъект.ПроцентВыполнения;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура УдалениеИсторииДокументов()
	
	Набор = РегистрыСведений.ИсторииЗадач.СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(ССылка.Задача);
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	ЭтотОбъект.ПоследнееИзменениеДокумента = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ЭтотОбъект.ДатаПоследнегоИзмененияДокумента = ТекущаяДата();  
	
	Если ЭтоНовый() Тогда
		
		// Проверка существования документа по выбранной задаче
		Если НЕ Документы.ДействиеПоЗадаче.НайтиПоРеквизиту("Задача", ЭтотОбъект.Задача).Ссылка.Пустая() Тогда
			Сообщить ("Действие по данной задаче уже заведено!");
		КонецЕсли;
		
	Иначе
		// Запись  данных в регистр сведений "ИстроииДокументов" при изменении данных документа
		РеквизитИзменен = Ложь;
		Для каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
				РеквизитИзменен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если РеквизитИзменен Тогда
			ЗаписьИсторииДокументов();
		КонецЕсли;
		
		// Удаление/запись данных документа в регистр сведений "ИстроииДокументов" при установке/снятии пометки удаления
		Если ЭтотОбъект.ПометкаУдаления <> ССылка.ПометкаУдаления Тогда
			Если ЭтотОбъект.ПометкаУдаления Тогда
				УдалениеИсторииДокументов();
			Иначе
				ЗаписьИсторииДокументов();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.ТРЗ = ТРЗпоСтатусам.Итог("Часы");
	
КонецПроцедуры


