Перем Запись;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Запись = Ложь;
	
	Если ЭтоНовый() Тогда
		
		// Проверка существования документа по выбранной задаче
		Если НЕ Документы.УправлениеЗадачей.НайтиПоРеквизиту("Заявка", ЭтотОбъект.Заявка).Ссылка.Пустая() Тогда
			Сообщить ("Документ по данной зявке уже заведен.");
			Отказ = Истина;
			Возврат;
		Иначе
			Запись = Истина;
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
	Иначе
		// Запись  данных в регистр сведений "ИстроииДокументов" при изменении данных документа
		Для каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
				Запись = Истина;
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтотОбъект.ТРЗ = ПланированиеТРЗ.Итог("Часы");
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Запись Тогда
		
		Движения.ИсторияУправлениеЗадачей.Записывать = Истина;
		Движение = Движения.ИсторияУправлениеЗадачей.Добавить();
		Движение.ДатаДокумента = Дата;
		Движение.НомерДокумента = Номер;
		Движение.АвторДокумента = Автор;
		Движение.ДатаПоследнегоИзменения = ТекущаяДата();
		Движение.ДатаПереносаВПродуктив = ДатаПереносаВПродуктив;
		Движение.ДатаТЗ = ДатаТЗ;
		Движение.ДатаДО = ДатаДО;
		Движение.ДополнительнаяИнформация = ДополнительнаяИнформация;
		Движение.Заявка = Заявка;
		Движение.Интеграция = Интеграция;
		Движение.Исполнитель = Исполнитель;
		Движение.КоличествоВозвратовНаДоработку = КоличествоВозвратовНаДоработку;
		Движение.КоличествоПСС = КоличествоПСС;
		Движение.КомментарийПоЗадаче = КомментарийПоЗадаче;
		Движение.Координатор = Координатор;
		Движение.ДатаФинала = ДатаФинала;
		Движение.АвторПоследнегоИзменения = ПараметрыСеанса.ТекущийПользователь;
		Движение.ПроцентВыполнения = ПроцентВыполнения;
		Движение.ПроцентПодготовкиТЗ = ПроцентПодготовкиТЗ;
		Движение.ПроцентПодготовкиДО = ПроцентПодготовкиДО;
		Движение.РаботыВыполнены = РаботыВыполнены;
		Движение.Статус = Статус;
		Движение.ТРЗ = ТРЗ;
		Движение.ЧасыДоФинала = ЧасыДоФинала;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Заявки") Тогда
		Заявка = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры


