Перем ЗаполнитьГрафик;

Процедура ПередЗаписью(Отказ)
	ЗаполнитьГрафик = Ложь;
	Если ЭтотОбъект.Исполнитель Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендарьГрафиковРаботы.Период
		|ИЗ
		|	РегистрСведений.КалендарьГрафиковРаботы КАК КалендарьГрафиковРаботы
		|ГДЕ
		|	КалендарьГрафиковРаботы.Исполнитель = &Исполнитель
		|	И КалендарьГрафиковРаботы.Год = &Год";
		
		Запрос.УстановитьПараметр("Год", Год(ТекущаяДата()));
		Запрос.УстановитьПараметр("Исполнитель", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			ЗаполнитьГрафик = Истина;		
		КонецЕсли;
	//ИначеЕсли Ссылка.Исполнитель <> ЭтотОбъект.Исполнитель Тогда
		
	КонецЕсли;
КонецПроцедуры
 
Процедура ЗаполнитьГрафикРаботы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныйКалендарь.Период,
		|	ПроизводственныйКалендарь.Год,
		|	ПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.КалендарьГрафиковРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Исполнитель.Установить(ЭтотОбъект.Ссылка); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Исполнитель = ЭтотОбъект.Ссылка;
		НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Период;  
		НоваяЗапись.Год = ВыборкаДетальныеЗаписи.Год;
		Если ВыборкаДетальныеЗаписи.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Или 
			ВыборкаДетальныеЗаписи.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
			НоваяЗапись.ВидВремениРаботы = Перечисления.ВидыВремениРаботы.Основной;
		Иначе
			НоваяЗапись.ВидВремениРаботы = Перечисления.ВидыВремениРаботы.Выходной;
		КонецЕсли;
		НоваяЗапись.КоличествоРабочихЧасов = 8; 
	КонецЦикла;
		
	НаборЗаписей.Записать();	
КонецПроцедуры                                                              

Процедура ПриЗаписи(Отказ)
	Если ЗаполнитьГрафик Тогда
		ЗаполнитьГрафикРаботы();
	КонецЕсли;
КонецПроцедуры
