
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Предупредить = ПередЗаписьюНаСервере();
	Если Предупредить Тогда
		ПоказатьПредупреждение(,"На данную дату назначен отпуск!");
	КонецЕсли;
КонецПроцедуры

Функция ПередЗаписьюНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудников.Сотрудник
		|ИЗ
		|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
		|ГДЕ
		|	ОтпускаСотрудников.Период = &Период
		|	И ОтпускаСотрудников.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Запись.Период);
	Запрос.УстановитьПараметр("Сотрудник", Запись.Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции
