&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос();
КонецПроцедуры

&НаСервере
Процедура Запрос()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиИсполнителяЗадачиПоИсполнителю.Ссылка КАК Задача,
		|	ЗадачиИсполнителяЗадачиПоИсполнителю.Основание КАК Основание,
		|	ПланированиеТРЗ.Часы,
		|	ПланированиеТРЗ.Статус
		|ИЗ
		|	Задача.ЗадачиИсполнителя.ЗадачиПоИсполнителю КАК ЗадачиИсполнителяЗадачиПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланированиеТРЗ КАК ПланированиеТРЗ
		|		ПО ЗадачиИсполнителяЗадачиПоИсполнителю.Основание = ПланированиеТРЗ.СсылкаНаДокумент
		|ГДЕ
		|	ПланированиеТРЗ.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗадачиДня.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Запрос();
КонецПроцедуры


