&НаСервере
Процедура ОбновитьОтпускаСотрудниковНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудников.Период,
		|	ОтпускаСотрудников.Сотрудник
		|ИЗ
		|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		МенеджерЗаписи = РегистрыСведений.ЗадачиСотрудников.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ТипЗадачи = Перечисления.ТипыЗадач.Отпуск; 
		//МенеджерЗаписи.Задача = Перечисления.ТипыЗадач.Отпуск; 
		МенеджерЗаписи.Период = ВыборкаДетальныеЗаписи.Период; 
		МенеджерЗаписи.Исполнитель = ВыборкаДетальныеЗаписи.Сотрудник;
		МенеджерЗаписи.Записать();  
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтпускаСотрудников(Команда)
	ОбновитьОтпускаСотрудниковНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
