Перем Запись;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Запись Тогда
		
		Движения.НевыходыИсполнителей.Записывать = Истина;
		День = ДатаНачала;
		Пока Не День > ДатаКонца Цикл
			Движение = Движения.НевыходыИсполнителей.Добавить();
			Движение.Период = День;
			Движение.Исполнитель = Исполнитель;
			Движение.ВидДня = ВидДня;
			День = День + 86400;
		КонецЦикла;
		
		Движения.ИсторияНевыходы.Записывать = Истина;
		Движение = Движения.ИсторияНевыходы.Добавить();
		Движение.НомерДокумента = Номер;
		Движение.ДатаДокумента = Дата;
		Движение.АвторДокумента = Автор;
		Движение.Исполнитель = Исполнитель;
		Движение.ДатаНачала = ДатаНачала;
		Движение.ДатаКонца = ДатаКонца;
		Движение.ВидДня = ВидДня;
		Движение.АвторПоследнегоИзменения = ПараметрыСеанса.ТекущийПользователь;
		Движение.ДатаПоследнегоИзменения = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Запись = Ложь;
	
	Для каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Если ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			Запись = Истина;
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект.Дата = ТекущаяДата();
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

