
//Функция  СериализоватьЗначениеВСтроку
// Преобразовывает значение реквизита в строку в соответствии с 
// форматом интеграционной шины
//  Параметры:
//   ЗначениеРеквизита - (Число, Строка, Булево, Дата)
//  Возвращаемое значение - Строка 
//
Функция СериализоватьЗначениеВСтроку(ЗНАЧ ЗначениеРеквизита, ЗНАЧ КлючевоеПолеРеквизита = Неопределено) Экспорт
	
	ТипРеквизита = ТипЗнч(ЗначениеРеквизита);
	Если ЗначениеРеквизита = Null Тогда
		Результат = "";
	ИначеЕсли ТипРеквизита = Тип("Строка") Тогда
		Результат = ЗначениеРеквизита;
	ИначеЕсли ТипРеквизита = Тип("Булево") Тогда
		Результат = ?(ЗначениеРеквизита, "X", "");
	ИначеЕсли ТипРеквизита = Тип("Число") Тогда
		Результат = Формат(ЗначениеРеквизита, "ЧРД=.; ЧГ=0");
	ИначеЕсли ТипРеквизита = Тип("Дата") Тогда
		Если Год(ЗначениеРеквизита) = 3999 Тогда
			ЗначениеРеквизита = Дата(9999, Месяц(ЗначениеРеквизита), День(ЗначениеРеквизита), Час(ЗначениеРеквизита),
			Минута(ЗначениеРеквизита), Секунда(ЗначениеРеквизита));
		КонецЕсли; 
		Результат = Формат(ЗначениеРеквизита, "ДФ=yyyyMMddHHmmss");
	//ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипРеквизита) ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
	//	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//		Если ЗначениеЗаполнено(КлючевоеПолеРеквизита) Тогда
	//			Если ТипЗнч(КлючевоеПолеРеквизита) = Тип("Строка") Тогда
	//				Если КлючевоеПолеРеквизита = "GUID" Тогда
	//					Результат = Строка(ЗначениеРеквизита.УникальныйИдентификатор());
	//				Иначе
	//					Результат = СериализоватьЗначениеВСтроку(ЗначениеРеквизита[КлючевоеПолеРеквизита]);
	//				КонецЕсли;
	//			ИначеЕсли ТипЗнч(КлючевоеПолеРеквизита) = Тип("СправочникСсылка.СвойстваСправочниковНСИ") Тогда
	//				Результат = СериализоватьЗначениеВСтроку(ЗначениеРеквизита[КлючевоеПолеРеквизита.Наименование]);
	//			КонецЕсли;
	//		Иначе
	//			Результат = ЗначениеРеквизита.Код;
	//			Если ПустаяСтрока(Результат) Тогда // Получаем метаданные, только если код пустой, т.к. операция затратная по ресурсам
	//				МетаданныеЗначения = ЗначениеРеквизита.Метаданные();
	//				Если МетаданныеЗначения.ДлинаКода = 0 И МетаданныеЗначения.ДлинаНаименования > 0 Тогда
	//					Результат = ЗначениеРеквизита.Наименование;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	Иначе
	//		Результат = "";
	//	КонецЕсли;
	//ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
	//	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//		Если ЗначениеЗаполнено(КлючевоеПолеРеквизита) Тогда
	//			Если ТипЗнч(КлючевоеПолеРеквизита) = Тип("Строка") Тогда
	//				Если КлючевоеПолеРеквизита = "GUID" Тогда
	//					Результат = Строка(ЗначениеРеквизита.УникальныйИдентификатор());
	//				Иначе
	//					Результат = СериализоватьЗначениеВСтроку(ЗначениеРеквизита[КлючевоеПолеРеквизита]);
	//				КонецЕсли;
	//			ИначеЕсли ТипЗнч(КлючевоеПолеРеквизита) = Тип("СправочникСсылка.СвойстваСправочниковНСИ") Тогда
	//				Результат = СериализоватьЗначениеВСтроку(ЗначениеРеквизита[КлючевоеПолеРеквизита.Наименование]);
	//			КонецЕсли;
	//		Иначе
	//			Результат = ЗначениеРеквизита.Код;
	//		КонецЕсли;
	//	Иначе
	//		Результат = "";
	//	КонецЕсли;
	//ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
	//	Результат = ?(ЗначениеЗаполнено(ЗначениеРеквизита), ЗначениеРеквизита.Номер, "");
	Иначе
		Результат = Строка(ЗначениеРеквизита);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СериализоватьЗначениеВСтроку()

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров
// начинается с единицы.
//
// Параметры
//  СтрокаПодстановки  – Строка – шаблон строки с параметрами (вхождениями вида "%ИмяПараметра").
// Параметр<n>         - Строка - параметр
// Возвращаемое значение:
//   Строка   – текстовая строка с подставленными параметрами
//
// Пример:
// Строка = ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк");
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Если СтрокаПодстановки = Неопределено ИЛИ СтрДлина(СтрокаПодстановки) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	НачПозиция = 1;
	Позиция = 1;
	Пока Позиция <= СтрДлина(СтрокаПодстановки) Цикл
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		Если СимволСтроки <> "%" Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, Позиция - НачПозиция);
		Позиция = Позиция + 1;
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		
		Если СимволСтроки = "%" Тогда
			Позиция = Позиция + 1;
			НачПозиция = Позиция;
			Результат = Результат + "%";
			Продолжить;
		КонецЕсли;
		
		Попытка
			НомерПараметра = Число(СимволСтроки);
		Исключение
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + СимволСтроки);
		КонецПопытки;
		
		Если СимволСтроки = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли СимволСтроки = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли СимволСтроки = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли СимволСтроки = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли СимволСтроки = "5" Тогда
			ЗначениеПараметра = Параметр5;
		ИначеЕсли СимволСтроки = "6" Тогда
			ЗначениеПараметра = Параметр6;
		ИначеЕсли СимволСтроки = "7" Тогда
			ЗначениеПараметра = Параметр7;
		ИначеЕсли СимволСтроки = "8" Тогда
			ЗначениеПараметра = Параметр8;
		ИначеЕсли СимволСтроки = "9" Тогда
			ЗначениеПараметра = Параметр9;
		Иначе
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + ЗначениеПараметра);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = "";
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		Результат = Результат + ЗначениеПараметра;
		Позиция = Позиция + 1;
		НачПозиция = Позиция;
	
	КонецЦикла;
	
	Если (НачПозиция <= СтрДлина(СтрокаПодстановки)) Тогда
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, СтрДлина(СтрокаПодстановки) - НачПозиция + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
