
&НаКлиенте
Процедура СдвинутьЗадачи(Команда)
	СдвинутьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СдвинутьЗадачиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиСотрудников.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЗадачиСотрудников КАК ЗадачиСотрудников
		|ГДЕ
		|	ЗадачиСотрудников.Исполнитель = &Исполнитель
		|	И ЗадачиСотрудников.Период >= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Исполнитель", Сотрудник);
	Запрос.УстановитьПараметр("Период", ДатаНачалаСдвига);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПереносов = Новый Массив;
	ДатаПереносаКонечная = '00000000';
	ПерваяДата = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПерваяДата Тогда
			 ДатаПереноса = ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига * 24*60*60;
			 ПерваяДата = Ложь;
		ИначеЕсли ВыборкаДетальныеЗаписи.Период <> ДатаПереносаКонечная + 24*60*60 Тогда
			Если  ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига * 24*60*60 <= ДатаПереносаКонечная Тогда
				ДатаПереноса = ДатаПереносаКонечная + 24*60*60; 
			Иначе
			 	ДатаПереноса = ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига;
			КонецЕсли;
		Иначе
			 ДатаПереноса = ДатаПереносаКонечная + 24*60*60;   
		КонецЕсли;
		 
		ДатаПереносаКонечная = ПроверкаВозможностиПереноса(ДатаПереноса,Сотрудник);
		МассивПереносов.Добавить(ДатаПереносаКонечная);
		
	КонецЦикла;
	Если МассивПереносов.Количество() > 0 Тогда		
		УстановитьНовыеДаты(МассивПереносов);
		Сообщить("Задачи сдвинуты!");		
	Иначе
		Сообщить("Задач для сдвига не найдео!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаВозможностиПереноса(Дата,Исполнитель)
	Отпуск = ФункцииПроверки.ПроверкаОтпусков(Дата, Исполнитель);
	Выходной = ФункцииПроверки.ПроверкаГрафикаРаботы(Дата,Исполнитель);
	ДатаЗадачи = Дата;
	
	Если Отпуск Или Выходной Тогда
	 	ДатаЗадачи = ДатаЗадачи + 24*60*60;
		ДатаЗадачи =  ПроверкаВозможностиПереноса(ДатаЗадачи,Исполнитель);
	КонецЕсли; 
	
	Возврат ДатаЗадачи;

КонецФункции 

&НаСервере
Процедура УстановитьНовыеДаты(Массив)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиСотрудников.Период КАК Период,
		|	ЗадачиСотрудников.ТипЗадачи,
		|	ЗадачиСотрудников.Задача,
		|	ЗадачиСотрудников.Исполнитель,
		|	ЗадачиСотрудников.СсылкаНаДокумент,
		|	ЗадачиСотрудников.Часы,
		|	ЗадачиСотрудников.ВыходнойОтпуск,
		|	ЗадачиСотрудников.Статус,
		|	ЗадачиСотрудников.Комментарий
		|ИЗ
		|	РегистрСведений.ЗадачиСотрудников КАК ЗадачиСотрудников
		|ГДЕ
		|	ЗадачиСотрудников.Исполнитель = &Исполнитель
		|	И ЗадачиСотрудников.Период >= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Исполнитель", Сотрудник);
	Запрос.УстановитьПараметр("Период", ДатаНачалаСдвига);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Номер = 0;
	
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЗадачиСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ТипЗадачи.Установить(ВыборкаДетальныеЗаписи.ТипЗадачи);
		НаборЗаписей.Отбор.Задача.Установить(ВыборкаДетальныеЗаписи.Задача);
		НаборЗаписей.Отбор.Исполнитель.Установить(ВыборкаДетальныеЗаписи.Исполнитель);
		НаборЗаписей.Отбор.СсылкаНаДокумент.Установить(ВыборкаДетальныеЗаписи.СсылкаНаДокумент);
		НаборЗаписей.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ЗадачиСотрудников.СоздатьМенеджерЗаписи();			
		МенеджерЗаписи.Период = Массив[Номер];   
		МенеджерЗаписи.ТипЗадачи = ВыборкаДетальныеЗаписи.ТипЗадачи;
		МенеджерЗаписи.Задача = ВыборкаДетальныеЗаписи.Задача;
		МенеджерЗаписи.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
		МенеджерЗаписи.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.СсылкаНаДокумент;
		МенеджерЗаписи.Часы = ВыборкаДетальныеЗаписи.Часы;
		МенеджерЗаписи.ВыходнойОтпуск = ВыборкаДетальныеЗаписи.ВыходнойОтпуск;
		МенеджерЗаписи.Статус = ВыборкаДетальныеЗаписи.Статус;
		МенеджерЗаписи.Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
		МенеджерЗаписи.Записать();

		Номер = Номер + 1;
	КонецЦикла;	
КонецПроцедуры